{
  "backend/main.mo": "Main Motoko actor defining the hotel management system with data types (Hotel, UserProfile, DailyReport, Emergency, Task, AuditLog), in-memory state maps, default hotel initialization, and authorization mixin integration.",
  "feature_evidence.json": "Feature evidence report mapping the login infinite-loading-state fix to LoginPage.tsx, listing related components and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's React/TypeScript frontend.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including colors for background, foreground, sidebar, charts, and UI components.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'Cluster LPM' that mounts the app into a root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with all application routes (login, profile setup, admin, hotel) wrapped in role-based RequireAuth guards and rendered inside AppShell.",
  "frontend/src/components/admin/CreateHotelDialog.tsx": "Modal dialog component for creating a new hotel with a name input, validation, and submission via the useCreateHotel mutation hook.",
  "frontend/src/components/admin/CreateTaskDialog.tsx": "Modal dialog for creating a task with title, description, priority, due date, and multi-hotel selection, submitting via the useCreateTask mutation with BigInt timestamp conversion.",
  "frontend/src/components/admin/CreateUserDialog.tsx": "A dialog component for creating new users with fields for user ID, name, username, password, hotel assignment, security manager, and contact number; resets form on open and submits via a mutation.",
  "frontend/src/components/admin/DeleteHotelDialog.tsx": "A confirmation alert dialog for deleting a hotel by ID, showing a warning that the action is irreversible and that hotels with assigned users cannot be deleted.",
  "frontend/src/components/admin/DeleteUserDialog.tsx": "A confirmation alert dialog for deleting a user by ID, warning that the action cannot be undone and triggering the delete mutation on confirmation.",
  "frontend/src/components/admin/EditHotelDialog.tsx": "A dialog for editing an existing hotel's name and active status, pre-populating fields from the provided hotel object and submitting updates via a mutation.",
  "frontend/src/components/admin/EditUserDialog.tsx": "A dialog for editing an existing user's details including name, username, password, role, hotel assignment, and active status, with form validation and pre-population from the user profile.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "An empty file with no implemented content.",
  "frontend/src/components/auth/RequireAuth.tsx": "A route guard component that redirects unauthenticated users to the login page, shows loading states while verifying identity and profile, and enforces optional role-based access control.",
  "frontend/src/components/layout/AppShell.tsx": "The main application shell providing a sticky header with navigation links, a user dropdown menu with logout, and role-based nav items for admin vs. hotel user views.",
  "frontend/src/components/tasks/TaskCommentsPanel.tsx": "An empty file with no implemented content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated identities, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, login status, and helper flags to child components.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a warm hospitality-themed OKLCH color palette for both light and dark modes, plus utility overrides for buttons and dialog overlays.",
  "frontend/src/lib/auth/useAuth.ts": "Provides React Query hooks for fetching and saving the authenticated caller's user profile against the ICP backend, handling bootstrap admin token scenarios and authorization errors.",
  "frontend/src/lib/backend/admin.ts": "Exports React Query hooks for admin-level hotel management operations: fetching all hotels, creating, updating, and deleting hotels via the backend actor.",
  "frontend/src/lib/backend/analytics.ts": "Exports a stub React Query hook for fetching analytics summaries; currently disabled and returns null as the backend method is not yet implemented.",
  "frontend/src/lib/backend/audit.ts": "Exports a React Query hook that fetches audit logs from the backend actor.",
  "frontend/src/lib/backend/emergencies.ts": "Exports stub React Query hooks for emergency management (listing emergencies, submitting emergencies, and managing recipients); all are disabled or throw errors as the backend is not yet implemented.",
  "frontend/src/lib/backend/hotels.ts": "Exports a React Query hook that fetches all hotels from the backend actor.",
  "frontend/src/lib/backend/queries.ts": "Exports React Query hooks for fetching the authenticated caller's user role and user profile from the backend actor.",
  "frontend/src/lib/backend/reports.ts": "Exports stub React Query hooks for daily report operations (fetching personal/all reports and saving); all are disabled or throw errors as the backend is not yet implemented.",
  "frontend/src/lib/backend/tasks.ts": "Provides React Query hooks for task operations including fetching all/my tasks, creating tasks, retrieving task comments, and adding comments, each with toast notifications on success or error.",
  "frontend/src/lib/backend/users.ts": "Provides React Query hooks for user management operations: fetching all user profiles, and creating, updating, and deleting users, with toast notifications and query invalidation on completion.",
  "frontend/src/lib/export/csv.ts": "Exports an array of objects to a CSV file download by converting keys to headers and values to quoted CSV rows, then triggering a browser download.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with React Query's QueryClientProvider and a custom InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminAnalyticsPage.tsx": "Placeholder analytics dashboard page displaying static metric cards (reports, emergencies, tasks) with a notice that backend analytics functionality is not yet implemented.",
  "frontend/src/pages/admin/AdminAuditLogsPage.tsx": "Admin audit logs page that fetches and displays system activity logs in a filterable table, allowing filtering by action type and hotel.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with a grid of quick-action cards linking to analytics, reports, emergency log, tasks, hotels, users, emergency recipients, and audit logs.",
  "frontend/src/pages/admin/AdminEmergencyLogPage.tsx": "Displays a filterable table of all emergency alerts across hotels, showing date, severity, and hotel name fetched from the backend.",
  "frontend/src/pages/admin/AdminEmergencyRecipientsPage.tsx": "Manages SMS emergency notification contacts, allowing admins to add or remove phone numbers from the recipient list.",
  "frontend/src/pages/admin/AdminHotelsPage.tsx": "Lists all hotels in the cluster with their status and provides dialogs for creating, editing, and deleting hotel properties.",
  "frontend/src/pages/admin/AdminReportsDashboardPage.tsx": "Shows a filterable table of daily operational reports per hotel with CSV export functionality, noting that the backend feature is not yet implemented.",
  "frontend/src/pages/admin/AdminTasksPage.tsx": "Displays all tasks across hotels in a table with priority, status, due date, and assignments, and provides a dialog to create new tasks.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin page for managing user accounts, displaying a table of all users with their roles, hotel assignments, and status, with actions to create, edit, and delete users via dialogs.",
  "frontend/src/pages/hotel/DailyReportFormPage.tsx": "Form page for hotel staff to submit daily operational reports (occupancy, VIP arrivals, incidents, injuries, complaints) which are saved to the backend and redirect to the reports list on success.",
  "frontend/src/pages/hotel/EmergencyTriggerPage.tsx": "Form page allowing hotel staff to submit emergency alerts by selecting a category, severity level, and providing details, which triggers notifications to emergency response contacts.",
  "frontend/src/pages/hotel/HotelDashboardPage.tsx": "Hotel staff dashboard displaying a welcome message and a grid of quick-action cards linking to daily report submission, report history, emergency alerts, and task management.",
  "frontend/src/pages/hotel/MyDailyReportsPage.tsx": "Page displaying a table of the current user's previously submitted daily operational reports with timestamps and metrics, highlighting non-zero incident counts with destructive badges.",
  "frontend/src/pages/hotel/MyTasksPage.tsx": "Page showing a table of tasks assigned to the current hotel staff user, displaying title, description, priority, status (color-coded badges), and due date.",
  "frontend/src/pages/LoginPage.tsx": "Login page that handles Internet Identity authentication, manages login/retry/error states, and redirects authenticated users to the admin or hotel dashboard based on their role.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Profile setup page for newly authenticated users to enter their name and username; redirects users who already have a profile to their appropriate dashboard.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist/retrieve values via sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom HSL-based color tokens, typography/animate plugins, Inter font, warm box shadows, and accordion keyframe animations.",
  "project_state.json": "Project state metadata describing a fix request for an infinite loading bug on the login page, where users cannot authenticate via Internet Identity and are never redirected to their dashboard."
}