{
  "backend/main.mo": "Main Motoko actor defining hotel management system types (Hotel, UserProfile, DailyReport, Emergency, Task, etc.) and data structures with authentication/authorization mixins, default hotel initialization, and audit logging functionality.",
  "feature_evidence.json": "Feature evidence report documenting two authentication-related features: reverting login logic to Version 16 and fixing the 'user is already authenticated' error message, both targeting LoginPage.tsx with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files describing React components, pages, hooks, and utilities for the hotel management application including authentication, task management, reports, and admin functionality.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light/dark themes, enhanced dialog overlays with backdrop blur, and utility classes ensuring interactive button styling.",
  "frontend/index.html": "HTML entry point for the Cluster LPM application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application setup with TanStack Router configuration, QueryClient provider, route definitions for admin and hotel user pages, and RequireAuth wrapper for role-based access control.",
  "frontend/src/components/admin/CreateHotelDialog.tsx": "Dialog component for creating new hotels with form validation, loading states, and integration with useCreateHotel mutation hook.",
  "frontend/src/components/admin/CreateTaskDialog.tsx": "Dialog component for creating tasks with title, description, priority, due date, and multi-hotel selection using checkboxes, with form validation and integration with useCreateTask mutation.",
  "frontend/src/components/admin/CreateUserDialog.tsx": "Dialog component for creating new users with form validation, including fields for principal, name, username, hotel assignment, contact info, password, and role selection (admin/user).",
  "frontend/src/components/admin/DeleteHotelDialog.tsx": "Confirmation dialog for deleting hotels with warning that hotels with assigned users cannot be deleted.",
  "frontend/src/components/admin/DeleteUserDialog.tsx": "Confirmation dialog for deleting users by principal ID with loading state during deletion.",
  "frontend/src/components/admin/EditHotelDialog.tsx": "Dialog for editing hotel properties including name and active status with form validation and pre-population of existing data.",
  "frontend/src/components/admin/EditUserDialog.tsx": "Dialog for updating user profiles with fields for name, username, hotel assignment, contact info, password, active status, and role with validation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Empty file with no content.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication wrapper component that enforces login requirements, checks user active status, validates admin role access, and displays appropriate loading/error states.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout shell with header, navigation sidebar (admin vs hotel user menus), user profile dropdown, logout functionality, and footer with social links.",
  "frontend/src/components/tasks/TaskCommentsPanel.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color palette for warm hospitality theme, including light/dark mode variants and enhanced dialog/button interaction styles.",
  "frontend/src/lib/auth/useAuth.ts": "Authentication hooks using React Query for fetching/saving user profiles, checking admin status, with error handling for unauthorized access and automatic query invalidation.",
  "frontend/src/lib/backend/admin.ts": "React Query hooks for hotel management operations (CRUD) including getAllHotels, createHotel, updateHotel, and deleteHotel with toast notifications.",
  "frontend/src/lib/backend/analytics.ts": "Placeholder hook for analytics summary queries, currently disabled as backend implementation is not yet available.",
  "frontend/src/lib/backend/audit.ts": "React Query hook for fetching audit logs from the backend actor.",
  "frontend/src/lib/backend/emergencies.ts": "Placeholder hooks for emergency management (submission, recipients CRUD), currently disabled as backend implementation is not yet available.",
  "frontend/src/lib/backend/hotels.ts": "React Query hook for fetching all hotels from the backend, enabled when actor is available.",
  "frontend/src/lib/backend/queries.ts": "React Query hooks for fetching caller's user role and profile with single retry disabled and actor availability checks.",
  "frontend/src/lib/backend/reports.ts": "Placeholder hooks for daily report management (fetch my/all reports, save report), currently disabled as backend implementation is not yet available.",
  "frontend/src/lib/backend/tasks.ts": "React Query hooks for task management including fetching all tasks, user-specific tasks, creating tasks, and managing task comments with toast notifications.",
  "frontend/src/lib/backend/users.ts": "React Query hooks for user management operations including fetching all user profiles, creating users, and updating users with comprehensive error handling and logging.",
  "frontend/src/lib/export/csv.ts": "Utility function to export array data to CSV format with proper escaping and automatic download trigger.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider context for the entire app.",
  "frontend/src/pages/admin/AdminAnalyticsPage.tsx": "Analytics dashboard page displaying placeholder metrics for reports, emergencies, and tasks with a notice that backend functionality is not yet implemented.",
  "frontend/src/pages/admin/AdminAuditLogsPage.tsx": "Displays a filterable table of system audit logs with action type and hotel filters. Shows timestamp, principal, action, hotel name, and details for each log entry.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard landing page with quick action cards for navigating to analytics, reports, emergency log, tasks, hotels, users, emergency recipients, and audit logs.",
  "frontend/src/pages/admin/AdminEmergencyLogPage.tsx": "Displays a filterable table of emergency alerts across all hotels, showing timestamp, hotel, severity, location, description, and reporter information.",
  "frontend/src/pages/admin/AdminEmergencyRecipientsPage.tsx": "Manages SMS notification contacts for emergency alerts with add/remove functionality and a table displaying current recipients.",
  "frontend/src/pages/admin/AdminHotelsPage.tsx": "Manages hotel properties with a table showing ID, name, and status, plus dialogs for creating, editing, and deleting hotels.",
  "frontend/src/pages/admin/AdminReportsDashboardPage.tsx": "Displays daily operational reports with hotel filtering and CSV export functionality, though shows an alert that backend implementation is pending.",
  "frontend/src/pages/admin/AdminTasksPage.tsx": "Admin page for viewing all tasks across hotels with a table displaying task details (title, priority, status, due date, assigned hotels/users) and a button to create new tasks via CreateTaskDialog.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin page for managing user accounts, displaying a table of all users with their profiles (name, username, role, hotel, contact, status) and action buttons to create, edit, or delete users.",
  "frontend/src/pages/hotel/DailyReportFormPage.tsx": "Form page for hotel staff to submit daily operational reports with numeric fields for occupancy, VIP arrivals, incidents, complaints, and injuries, which are saved to the backend upon submission.",
  "frontend/src/pages/hotel/EmergencyTriggerPage.tsx": "Emergency alert submission page allowing hotel staff to report urgent situations by selecting a category, severity level, and providing details, which triggers immediate notifications.",
  "frontend/src/pages/hotel/HotelDashboardPage.tsx": "Main dashboard for hotel staff displaying quick action cards for submitting daily reports, viewing reports, triggering emergency alerts, and managing tasks.",
  "frontend/src/pages/hotel/MyDailyReportsPage.tsx": "Page displaying a table of all daily reports submitted by the current user, showing operational metrics (occupancy, incidents, complaints, injuries) with timestamps.",
  "frontend/src/pages/hotel/MyTasksPage.tsx": "React component that displays a user's assigned tasks in a table format with loading states, status badges, priority indicators, and formatted due dates using the useGetMyTasks hook.",
  "frontend/src/pages/LoginPage.tsx": "Login page component handling Internet Identity authentication with timeout management, multi-stage login flow, and automatic redirection to admin after successful authentication.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Profile setup page for new users to enter their name and username after authentication, with error handling for authorization issues.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including HSL-based color variables, custom shadows, animations, and typography plugin integration for the frontend application.",
  "project_state.json": "Project metadata tracking known authentication issues (broken login in v17, 'already authenticated' error in v16) and feature requests to revert and fix login functionality."
}