{
  "backend/main.mo": "Main actor defining hotel management system with types for hotels, users, daily reports, emergencies, tasks, and audit logs; includes authentication via MixinAuthorization, default hotel initialization, and various CRUD operations with role-based access control.",
  "backend/migration.mo": "Migration module defining ActorV1 and ActorV2 schemas with a run function that migrates users map from Principal-keyed to Text-keyed (using principal.toText()) and adds nextUserId field.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: removing principal ID input from CreateUserDialog form and updating useCreateUser hook to handle principal ID server-side.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including routing, authentication, React Query hooks for backend operations, UI components for admin and hotel user workflows, and styling with OKLCH color system.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH-based color variables for light and dark themes, including warm hospitality-focused palette and sidebar styling.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Cluster LPM application.",
  "frontend/src/App.tsx": "Main application setup with TanStack Router configuration, QueryClient provider, route definitions for admin and hotel user pages, and RequireAuth wrapper for role-based access control.",
  "frontend/src/components/admin/CreateHotelDialog.tsx": "Dialog component for creating new hotels with form validation, loading states, and integration with useCreateHotel mutation hook.",
  "frontend/src/components/admin/CreateTaskDialog.tsx": "Dialog component for creating tasks with form validation, hotel selection via checkboxes, and submission that converts dates to nanosecond timestamps and assigns tasks to multiple hotels.",
  "frontend/src/components/admin/CreateUserDialog.tsx": "Dialog component for creating new users with form validation, hotel assignment, role selection (admin/user), and password requirements (minimum 8 characters).",
  "frontend/src/components/admin/DeleteHotelDialog.tsx": "Alert dialog component for confirming hotel deletion with a warning that hotels with assigned users cannot be deleted.",
  "frontend/src/components/admin/DeleteUserDialog.tsx": "Alert dialog component for confirming user deletion with loading state during the deletion process.",
  "frontend/src/components/admin/EditHotelDialog.tsx": "Dialog component for editing hotel properties including name and active status, with form pre-population from existing hotel data.",
  "frontend/src/components/admin/EditUserDialog.tsx": "Dialog component for editing user details including name, username, hotel assignment, role, active status, and password with validation and form pre-population.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Empty file with no content.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication wrapper component that verifies user identity, checks admin/user roles, handles loading states, and displays error screens for deactivated accounts or authentication failures.",
  "frontend/src/components/layout/AppShell.tsx": "Main application shell component providing navigation header, sidebar with role-based menu items (admin vs hotel), user profile dropdown, and footer with social links.",
  "frontend/src/components/tasks/TaskCommentsPanel.tsx": "Empty file, no content provided.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance with authentication, initializes access control with admin token, and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color palette for warm hospitality theme, dark mode support, and utility classes for dialogs and interactive elements.",
  "frontend/src/lib/auth/useAuth.ts": "Authentication hooks for fetching and saving user profiles, checking admin status, with React Query integration for caching and error handling.",
  "frontend/src/lib/backend/admin.ts": "React Query hooks for admin hotel management operations: fetching all hotels, creating, updating, and deleting hotels with toast notifications.",
  "frontend/src/lib/backend/analytics.ts": "Placeholder hook for analytics summary queries, currently disabled as backend implementation is not yet available.",
  "frontend/src/lib/backend/audit.ts": "React Query hook for fetching audit logs from the backend actor.",
  "frontend/src/lib/backend/emergencies.ts": "Placeholder hooks for emergency management (submit, fetch, recipient management), all disabled as backend implementation is not yet available.",
  "frontend/src/lib/backend/hotels.ts": "React Query hook for fetching all hotels from the backend actor.",
  "frontend/src/lib/backend/queries.ts": "Defines React Query hooks for fetching the current user's role and profile from the backend actor, with proper loading and error states.",
  "frontend/src/lib/backend/reports.ts": "Contains placeholder React Query hooks for daily report functionality (get my reports, get all reports, save report) that are currently disabled as the backend implementation is not yet available.",
  "frontend/src/lib/backend/tasks.ts": "Provides React Query hooks for task management including fetching user/all tasks, creating tasks, and managing task comments with toast notifications.",
  "frontend/src/lib/backend/users.ts": "Implements React Query hooks for user management including fetching all user profiles and creating new users with detailed error handling and logging for authorization and validation errors.",
  "frontend/src/lib/export/csv.ts": "Utility function that exports an array of objects to a CSV file with proper escaping and downloads it to the user's browser.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/admin/AdminAnalyticsPage.tsx": "Analytics dashboard page displaying placeholder metrics cards for reports, emergencies, and tasks with a notice that backend functionality is not yet implemented.",
  "frontend/src/pages/admin/AdminAuditLogsPage.tsx": "Displays a filterable table of system audit logs with action type and hotel filters. Shows timestamp, principal, action, hotel, and details for each log entry.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Main administrator dashboard with quick action cards linking to analytics, reports, emergency log, tasks, hotels, users, emergency recipients, and audit logs sections.",
  "frontend/src/pages/admin/AdminEmergencyLogPage.tsx": "Displays all emergency alerts across hotels in a filterable table showing date, hotel, severity, room, description, and reported by information.",
  "frontend/src/pages/admin/AdminEmergencyRecipientsPage.tsx": "Manages SMS notification contacts for emergency alerts with add/remove functionality and a table displaying current recipients.",
  "frontend/src/pages/admin/AdminHotelsPage.tsx": "Manages hotel properties with a table view and dialogs for creating, editing, and deleting hotels. Shows hotel ID, name, and active status.",
  "frontend/src/pages/admin/AdminReportsDashboardPage.tsx": "Displays daily operational reports in a filterable table with CSV export functionality. Includes alert noting backend implementation is pending.",
  "frontend/src/pages/admin/AdminTasksPage.tsx": "Admin page for viewing all tasks across hotels with a table displaying task details (title, priority, status, due date, assigned hotels/users) and a button to create new tasks via CreateTaskDialog.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin page for managing user accounts, displaying a table of all users with their profiles (name, username, role, hotel, contact, status) and actions to create, edit, or delete users through respective dialogs.",
  "frontend/src/pages/hotel/DailyReportFormPage.tsx": "Hotel user page with a form to submit daily operational reports including numeric fields for occupancy, VIP arrivals, incidents, complaints, and injuries; validates hotel assignment and navigates to reports list on success.",
  "frontend/src/pages/hotel/EmergencyTriggerPage.tsx": "Hotel user page for submitting emergency alerts with category selection, severity level, and details; triggers immediate notifications and validates hotel assignment before submission.",
  "frontend/src/pages/hotel/HotelDashboardPage.tsx": "Main dashboard for hotel users displaying quick action cards to navigate to daily reports, view submitted reports, trigger emergency alerts, and manage assigned tasks.",
  "frontend/src/pages/hotel/MyDailyReportsPage.tsx": "Hotel user page displaying a table of all daily reports submitted by the current user, showing operational metrics (occupancy, VIP arrivals, incidents, complaints, injuries) with timestamps and badge highlighting for non-zero incident counts.",
  "frontend/src/pages/hotel/MyTasksPage.tsx": "React component that displays a user's assigned tasks in a table format with status badges, priority levels, and due dates, fetching data via useGetMyTasks hook.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that handles Internet Identity authentication with timeout handling, loading stages, and automatic redirection to admin dashboard upon successful authentication.",
  "frontend/src/pages/ProfileSetupPage.tsx": "Profile setup page that allows authenticated users to create their profile by entering name and username, with error handling for authorization issues.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (using CSS variables), typography, animations, shadows, and container settings for the frontend application.",
  "project_state.json": "Project state tracking document indicating an in-progress fix to remove the principal ID input field from user creation forms and automate principal ID generation server-side."
}