{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove principal ID field from user creation form",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the principal ID input field from the CreateUserDialog form component",
      "acceptanceCriteria": [
        "Principal ID field is no longer visible in the user creation dialog",
        "Form validation no longer requires principal ID input",
        "User creation form only contains name, username, hotel assignment, contact info, password, and role fields"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/CreateUserDialog.tsx",
          "operation": "modify",
          "description": "Remove the principal ID input field and its validation from the CreateUserDialog component. Remove the principalId state variable, the Principal.fromText validation logic, and the form field that collects principal ID from users. Update the form submission to exclude principal ID from the data sent to the backend."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the useCreateUser mutation hook to remove principal ID parameter from user creation",
      "acceptanceCriteria": [
        "useCreateUser mutation no longer accepts principal ID as a parameter",
        "Backend createUser method automatically assigns or generates principal ID",
        "User creation succeeds without client-provided principal ID"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/backend/users.ts",
          "operation": "modify",
          "description": "Update the useCreateUser mutation hook to remove the principalId parameter from the createUser backend method call. The mutation should now only pass name, username, hotelId, securityManager, contactNumber, password, and role to the backend. Update the TypeScript types if needed to reflect that principal ID is no longer part of the mutation input."
        }
      ]
    }
  ]
}